{"modules":[{"type":"paragraph-container","value":[{"type":"paragraph","value":[{"type":"text","value":"The Federal Government of the United States (U.S. Federal Government) is the national government of the United States, a federal republic in North America, composed of 50 states, one district—Washington, D.C., and several territories. The federal government is composed of three distinct branches: legislative, executive, and judicial, whose powers are vested by the U.S. Constitution in the Congress, the president, and the federal courts, respectively. The powers and duties of these branches are further defined by acts of Congress, including the creation of executive departments and courts inferior to the Supreme Court."}]}]},{"type":"heading","value":"Naming"},{"type":"paragraph-container","value":[{"type":"paragraph","value":[{"type":"text","value":"The full name of the republic is \"United States of America\". No other name appears in the Constitution, and this is the name that appears on money, in treaties, and in legal cases to which it is a party (e.g. Charles T. Schenck v. United States). The terms \"Government of the United States of America\" or \"United States Government\" are often used in official documents to represent the federal government as distinct from the states collectively. In casual conversation or writing, the term \"Federal Government\" is often used, and the term \"National Government\" is sometimes used. The terms \"Federal\" and \"National\" in government agency or program names generally indicate affiliation with the federal government (Federal Bureau of Investigation, National Oceanic and Atmospheric Administration, National Park Service). Because the seat of government is in Washington, D.C., \"Washington\" is commonly used as a metonym for the federal government."}]}]},{"type":"heading","value":"History"},{"type":"paragraph-container","value":[{"type":"paragraph","value":[{"type":"text","value":"The United States government is based on the principles of federalism and republicanism, in which power is shared between the federal government and state governments. The interpretation and execution of these principles, including what powers the federal government should have and how those powers can be exercised, have been debated ever since the adoption of the Constitution. Some make the case for expansive federal powers while others argue for a more limited role for the central government in relation to individuals, the states, or other recognized entities."}]},{"type":"paragraph","value":[{"type":"text","value":"Since the American Civil War, the powers of the federal government have generally expanded greatly, although there have been periods since that time of legislative branch dominance (e.g., the decades immediately following the Civil War) or when states' rights proponents have succeeded in limiting federal power through legislative action, executive prerogative or by constitutional interpretation by the courts."}]},{"type":"paragraph","value":[{"type":"text","value":"One of the theoretical pillars of the U.S. Constitution is the idea of \"checks and balances\" among the powers and responsibilities of the three branches of American government: the executive, the legislative, and the judiciary. For example, while the legislative branch (Congress) has the power to create law, the executive branch under the president can veto any legislation—an act which, in turn, can be overridden by Congress. The president nominates judges to the nation's highest judiciary authority, the Supreme Court, but those nominees must be approved by Congress. The Supreme Court, in turn, can invalidate unconstitutional laws passed by the Congress. These and other examples are examined in more detail in the text below."}]}]},{"type":"heading","value":"Legislative branch"},{"type":"paragraph-container","value":[{"type":"paragraph","value":[{"type":"text","value":"The United States Congress is the legislative branch of the federal government. It is bicameral, comprising the House of Representatives and the Senate."}]},{"type":"paragraph","value":[{"type":"text","value":"<div><b>House of Representatives</b></div><div><br></div><div>The House currently consists of 435 voting members, each of whom represents a congressional district. The number of representatives each state has in the House is based on each state's population as determined in the most recent United States Census. All 435 representatives serve a two-year term. Each state receives a minimum of one representative in the House. In order to be elected as a representative, an individual must be at least 25 years of age, must have been a U.S. citizen for at least seven years, and must live in the state that he or she represents. There is no limit on the number of terms a representative may serve. In addition to the 435 voting members, there are 6 non-voting members, consisting of 5 delegates and one resident commissioner. There is one delegate each from the District of Columbia, Guam, the Virgin Islands, American Samoa, and the Commonwealth of the Northern Mariana Islands, and the resident commissioner from Puerto Rico.<br></div>"}]},{"type":"paragraph","value":[{"type":"text","value":"<b>Senate</b><div><br></div><div>In contrast, the Senate is made up of two senators from each state, regardless of population. There are currently 100 senators (2 from each of the 50 states), who each serve six-year terms. Approximately one-third of the Senate stands for election every two years.<br></div>"}]},{"type":"paragraph","value":[{"type":"text","value":"<b>Different powers</b><div><br></div><div>The House and Senate each have particular exclusive powers. For example, the Senate must approve (give \"advice and consent\" to) many important presidential appointments, including cabinet officers, federal judges (including nominees to the Supreme Court), department secretaries (heads of federal executive branch departments), U.S. military and naval officers, and ambassadors to foreign countries. All legislative bills for raising revenue must originate in the House of Representatives. The approval of both chambers is required to pass all legislation, which then may only become law by being signed by the president (or, if the president vetoes the bill, both houses of Congress then re-pass the bill, but by a two-thirds majority of each chamber, in which case the bill becomes law without the president's signature). The powers of Congress are limited to those enumerated in the Constitution; all other powers are reserved to the states and the people. The Constitution also includes the \"Necessary and Proper Clause\", which grants Congress the power to \"make all laws which shall be necessary and proper for carrying into execution the foregoing powers\". Members of the House and Senate are elected by first-past-the-post voting in every state except Louisiana and Georgia, which have runoffs.<br></div>"}]},{"type":"paragraph","value":[{"type":"text","value":"<b>Impeachment of federal officers</b><div><br></div><div>Congress has the power to remove the president, federal judges, and other federal officers from office. The House of Representatives and Senate have separate roles in this process. The House must first vote to \"impeach\" the official. Then, a trial is held in the Senate to decide whether the official should be removed from office. Although two presidents have been impeached by the House of Representatives (Andrew Johnson and Bill Clinton), neither of them was removed following trial in the Senate.<br></div>"}]},{"type":"paragraph","value":[{"type":"text","value":"<b>Congressional procedures</b><div><br></div><div>Article I, Section 2, paragraph 2 of the U.S. Constitution gives each chamber the power to \"determine the rules of its proceedings\". From this provision were created congressional committees, which do the work of drafting legislation and conducting congressional investigations into national matters. The 108th Congress (2003–2005) had 19 standing committees in the House and 17 in the Senate, plus 4 joint permanent committees with members from both houses overseeing the Library of Congress, printing, taxation, and the economy. In addition, each house may name special, or select, committees to study specific problems. Today, much of the congressional workload is borne by the subcommittees, of which there are around 150.<br></div>"}]},{"type":"paragraph","value":[{"type":"text","value":"<b>Powers of Congress</b><div><br></div><div>Congressional oversight is intended to prevent waste and fraud, protect civil liberties and individual rights, ensure executive compliance with the law, gather information for making laws and educating the public, and evaluate executive performance.</div><div><br></div><div>It applies to cabinet departments, executive agencies, regulatory commissions, and the presidency.<br></div><div><br></div><div>Congress's oversight function takes many forms:<br></div>"}]},{"type":"list","value":["Committee inquiries and hearings","Formal consultations with and reports from the president","Senate advice and consent for presidential nominations and for treaties","House impeachment proceedings and subsequent Senate trials","House and Senate proceedings under the 25th Amendment in the event that the president becomes disabled or the office of the vice president falls vacant","Informal meetings between legislators and executive officials","Congressional membership: each state is allocated a number of seats based on its representation (or ostensible representation, in the case of D.C.) in the House of Representatives. Each state is allocated two senators regardless of its population. As of January 2010, the District of Columbia elects a non-voting representative to the House of Representatives along with American Samoa, the U.S. Virgin Islands, Guam, Puerto Rico, and the Northern Mariana Islands."]}]},{"type":"heading","value":"Executive branch"},{"type":"paragraph-container","value":[{"type":"paragraph","value":[{"type":"text","value":"The executive power in the federal government is vested in the President of the United States, although power is often delegated to the Cabinet members and other officials. The president and vice president are elected as running mates by the Electoral College, for which each state, as well as the District of Columbia, is allocated a number of seats based on its representation (or ostensible representation, in the case of D.C.) in both houses of Congress. The president is limited to a maximum of two four-year terms. If the president has already served two years or more of a term to which some other person was elected, he or she may only serve one more additional four-year term."}]},{"type":"paragraph","value":[{"type":"text","value":"<b>President</b><div><br></div><div>The executive branch consists of the president and those to whom the president's powers are delegated. The president is both the head of state and government, as well as the military commander-in-chief and chief diplomat. The president, according to the Constitution, must \"take care that the laws be faithfully executed\", and \"preserve, protect and defend the Constitution\". The president presides over the executive branch of the federal government, an organization numbering about 5 million people, including 1 million active-duty military personnel and 600,000 postal service employees.<br></div><div><br></div><div>The president may sign legislation passed by Congress into law or may veto it, preventing it from becoming law unless two-thirds of both houses of Congress vote to override the veto. The president may unilaterally sign treaties with foreign nations. However, ratification of international treaties requires a two-thirds majority vote in the Senate. The president may be impeached by a majority in the House and removed from office by a two-thirds majority in the Senate for \"treason, bribery, or other high crimes and misdemeanors\". The president may not dissolve Congress or call special elections but does have the power to pardon or release criminals convicted of offenses against the federal government (except in cases of impeachment), enact executive orders, and (with the consent of the Senate) appoint Supreme Court justices and federal judges.<br></div>"}]}]}],"infobox":{"heading":"US Federal Government","image":{"file":"/resources/svg/seal.svg","caption":"Great Seal of the United States"},"items":[{"type":"property","label":"Formation","value":"1789; 229 years ago"},{"type":"property","label":"Founding document","value":"United States Constitution"},{"type":"property","label":"Jurisdiction","value":"United States of America"},{"type":"property","label":"Website","value":"www.usa.gov"},{"type":"sub-heading","value":"Legislative branch"},{"type":"property","label":"Legislature","value":"Congress"},{"type":"property","label":"Meeting place","value":"Capitol"},{"type":"sub-heading","value":"Executive branch"},{"type":"property","label":"Leader","value":"President"},{"type":"property","label":"Appointer","value":"Electoral College"},{"type":"property","label":"Headquarters","value":"The White House"},{"type":"property","label":"Main organ","value":"Cabinet"},{"type":"property","label":"Departments","value":"15"},{"type":"sub-heading","value":"Judicial branch"},{"type":"property","label":"Court","value":"Supreme Court"},{"type":"property","label":"Seat","value":"Washington, D.C."}]}}