{
	"modules": [
		{
			"type": "paragraph-container",
			"value": [
				{
					"type": "paragraph",
					"value": [
						{
							"type": "text",
							"value": "The Federal Government of the United States (U.S. Federal Government) is the national government of the United States, a federal republic in North America, composed of 50 states, one district—Washington, D.C., and several territories. The federal government is composed of three distinct branches: legislative, executive, and judicial, whose powers are vested by the U.S. Constitution in the Congress, the president, and the federal courts, respectively. The powers and duties of these branches are further defined by acts of Congress, including the creation of executive departments and courts inferior to the Supreme Court."
						}
					]
				}
			]
		}, {
			"type": "heading",
			"value": "Naming"
		}, {
			"type": "paragraph-container",
			"value": [
				{
					"type": "paragraph",
					"value": [
						{
							"type": "text",
							"value": "The full name of the republic is \"United States of America\". No other name appears in the Constitution, and this is the name that appears on money, in treaties, and in legal cases to which it is a party (e.g. Charles T. Schenck v. United States). The terms \"Government of the United States of America\" or \"United States Government\" are often used in official documents to represent the federal government as distinct from the states collectively. In casual conversation or writing, the term \"Federal Government\" is often used, and the term \"National Government\" is sometimes used. The terms \"Federal\" and \"National\" in government agency or program names generally indicate affiliation with the federal government (Federal Bureau of Investigation, National Oceanic and Atmospheric Administration, National Park Service). Because the seat of government is in Washington, D.C., \"Washington\" is commonly used as a metonym for the federal government."
						}
					]
				}
			]
		}, {
			"type": "heading",
			"value": "History"
		}, {
			"type": "paragraph-container",
			"value": [
				{
					"type": "paragraph",
					"value": [
						{
							"type": "text",
							"value": "The United States government is based on the principles of federalism and republicanism, in which power is shared between the federal government and state governments. The interpretation and execution of these principles, including what powers the federal government should have and how those powers can be exercised, have been debated ever since the adoption of the Constitution. Some make the case for expansive federal powers while others argue for a more limited role for the central government in relation to individuals, the states, or other recognized entities."
						}
					]
				}, {
					"type": "paragraph",
					"value": [
						{
							"type": "text",
							"value": "Since the American Civil War, the powers of the federal government have generally expanded greatly, although there have been periods since that time of legislative branch dominance (e.g., the decades immediately following the Civil War) or when states' rights proponents have succeeded in limiting federal power through legislative action, executive prerogative or by constitutional interpretation by the courts."
						}
					]
				}
			]
		}
	],
	"infobox": {
		"heading": "US Federal Government",
		"main-image": {
			"file": "/resources/images/seal.svg",
			"caption": "Great Seal of the United States"
		},
		"items": [
			{
				"type": "property",
				"label": "Formation",
				"value": "1789; 229 years ago"
			}, {
				"type": "property",
				"label": "Founding document",
				"value": "United States Constitution"
			}, {
				"type": "property",
				"label": "Jurisdiction",
				"value": "United States of America"
			}, {
				"type": "property",
				"label": "Website",
				"value": "www.usa.gov"
			}, {
				"type": "sub-heading",
				"value": "Legislative branch"
			}, {
				"type": "property",
				"label": "Legislature",
				"value": "Congress"
			}, {
				"type": "property",
				"label": "Meeting place",
				"value": "Capitol"
			}, {
				"type": "sub-heading",
				"value": "Executive branch"
			}, {
				"type": "property",
				"label": "Leader",
				"value": "President"
			}, {
				"type": "property",
				"label": "Appointer",
				"value": "Electoral College"
			}, {
				"type": "property",
				"label": "Headquarters",
				"value": "The White House"
			}, {
				"type": "property",
				"label": "Main organ",
				"value": "Cabinet"
			}, {
				"type": "property",
				"label": "Departments",
				"value": "15"
			}, {
				"type": "sub-heading",
				"value": "Judicial branch"
			}, {
				"type": "property",
				"label": "Court",
				"value": "Supreme Court"
			}, {
				"type": "property",
				"label": "Seat",
				"value": "Washington, D.C."
			}
		]
	}
}