{"modules":[{"type":"section-content","value":[{"type":"paragraph","value":[{"type":"text","value":"<div>Rochester is a city on the southern shore of Lake Ontario in western New York. With a population of 208,046 residents, Rochester is the seat of Monroe County and the third most populous city in New York state, after New York City and Buffalo. The metropolitan area has a population of just over 1 million people.</div><div><br></div><div>Rochester was America's first boomtown, initially due to the fertile Genesee River Valley, which gave rise to numerous flour mills, and then as a manufacturing hub. Several of the region's universities (notably the University of Rochester and Rochester Institute of Technology) have renowned research programs. Rochester is the site of many important inventions and innovations in consumer products. The Rochester area has been the birthplace to Kodak, Western Union, French's, Bausch &amp; Lomb, Gleason and Xerox, which conduct extensive research and manufacturing of industrial and consumer products. Until 2010, the Rochester metropolitan area was the second-largest regional economy in New York State, after the New York City metropolitan area. Rochester's GMP has since ranked just below Buffalo, New York, while exceeding it in per-capita income.</div><div><br></div><div>The 25th edition of the Places Rated Almanac rated Rochester as the \"most livable city\" in 2007, among 379 U.S. metropolitan areas. In 2010 Forbes rated Rochester as the third-best place to raise a family in the United States. In 2012 Kiplinger rated Rochester as the fifth-best city in the United States for families, citing low cost of living, top public schools, and a low jobless rate.</div>"}]}]},{"type":"heading","value":"History"},{"type":"section-content","value":[{"type":"paragraph","value":[{"type":"text","value":"<div>The Seneca tribe of Native Americans lived in and around Rochester until they lost their claim to most of this land in the Treaty of Big Tree in 1797. Settlement before the Seneca tribe is unknown.</div><div><br></div><div>Development of Rochester followed the American Revolution, and forced cession of their territory by the Iroquois after the defeat of Great Britain. Allied with the British, four major Iroquois tribes were forced out of New York. As a reward for their loyalty to the British Crown, they were given a large land grant on the Grand River in Canada.</div><div><br></div><div>Rochester was founded shortly after the American Revolution by a wave of English-Puritan descended immigrants from New England who were looking for new agricultural land. They would be the dominant cultural group in Rochester for over a century. On November 8, 1803, Col. Nathaniel Rochester (1752–1831), Maj. Charles Carroll, and Col. William Fitzhugh, Jr. (1761–1839), all of Hagerstown, Maryland, purchased a 100-acre (c. 40 ha) tract from the state in Western New York along the Genesee River. They chose the site because its three cataracts on the Genesee offered great potential for water power. Beginning in 1811, and with a population of 15, the three founders surveyed the land and laid out streets and tracts. In 1817, the Brown brothers and other landowners joined their lands with the Hundred Acre Tract to form the village of Rochesterville.</div><div><br></div><div>By 1821, Rochesterville was the seat of Monroe County. In 1823, Rochesterville consisted of 1,012 acres (4 km2) and 2,500 residents, and the Village of Rochesterville became known as Rochester. Also in 1823, the Erie Canal aqueduct over the Genesee River was completed, and the Erie Canal east to the Hudson River was opened. In the early 20th century, after the advent of railroads, the presence of the canal in the center city was an obstacle; it was re-routed south of Rochester. By 1830, Rochester's population was 9,200 and in 1834, it was re-chartered as a city.</div><div><br></div><div>Rochester was first known as \"the Young Lion of the West\", and then as the \"Flour City\". By 1838, Rochester was the largest flour-producing city in the United States. Having doubled its population in only 10 years, Rochester became America's first \"boomtown\".</div><div><br></div><div>In 1830-31, Rochester experienced one of the nation's biggest Protestant revivalist movements, led by Charles Finney. The revival has been noted as inspiring other revivals of the Second Great Awakening. A leading pastor in New York who was converted in the Rochester meetings gave the following account of the effects of Finney's meetings in that city: \"The whole community was stirred. Religion was the topic of conversation in the house, in the shop, in the office and on the street. The only theater in the city was converted into a livery stable; the only circus into a soap and candle factory. Grog shops were closed; the Sabbath was honored; the sanctuaries were thronged with happy worshippers; a new impulse was given to every philanthropic enterprise; the fountains of benevolence were opened, and men lived to good.\"</div><div><br></div><div>By the mid-19th century, as the center of the wheat-processing industry moved west with population and agriculture, the city became home to an expanding nursery business, giving rise to the city's second nickname, the \"Flower City\". Nurseries ringed the city, the most famous of which was started in 1840 by immigrants Georg Ellwanger from Germany and Patrick Barry from Ireland.<br></div><div><br></div><div>In 1847, Frederick Douglass founded the abolitionist newspaper The North Star in Rochester. Douglass, a former slave and an antislavery speaker and writer, gained a circulation of over 4,000 readers in the United States, Europe, and the Caribbean. The North Star served as a forum for abolitionist views. The Douglass home burnt down in 1872, but a marker for it is found in Highland Park off South Avenue.<br></div><div><br></div><div>Susan B. Anthony, a national leader of the women's suffrage movement, was from Rochester. The Nineteenth Amendment to the United States Constitution, which guaranteed the right of women to vote in 1920, was known as the Susan B. Anthony Amendment because of her work toward its passage, which she did not live to see. Anthony's home is a National Historic Landmark known as the National Susan B. Anthony Museum and House.<br></div><div><br></div><div>At the end of the 19th century, anarchist Emma Goldman lived and worked in Rochester for several years, where she championed the cause of labor in Rochester sweatshops. Rochester was also home to significant unrest in labor, race, and antiwar protests.<br></div><div><br></div><div>After the Civil War, Rochester had an expansion of new industries in the late 19th century, founded by migrants to the city, including inventor and entrepreneur George Eastman, who founded Eastman Kodak; and German immigrants John Jacob Bausch and Henry Lomb, who launched Bausch &amp; Lomb in 1861. Not only did they create new industries, but Eastman became a major philanthropist, developing and endowing the University of Rochester, its Eastman School of Music and other local institutions.<br></div><div><br></div><div>In the early 20th century, Rochester became a center of the garment industry, particularly men's fashions. It was the base of enterprises Bond Clothing Stores, Fashion Park Clothes, Hickey Freeman, and Stein-Bloch &amp; Co. The carriage maker James Cunningham and Sons founded a pioneer automobile company – Cunningham.<br></div><div><br></div><div>The population reached 62,386 in 1870, 162,608 in 1900 and 295,750 in 1920. By 1950, the population had reached a high of 332,488. In 1950, the Census Bureau reported Rochester's population as 97.6% white and 2.3% black. With industrial restructuring in the later 20th century, and the decline of industry and jobs in the area, by 2010, the city's population had declined to 210,565, although the metropolitan area was considerably larger.<br></div>"}]}]},{"type":"heading","value":"Geography"},{"type":"section-content","value":[{"type":"paragraph","value":[{"type":"text","value":"Rochester is at 43°9′56″N 77°36′41″W (43.165496, −77.611504). The city is about 65 miles (100 km) east-northeast of Buffalo and about 75 miles (120 km) west of Syracuse; it sits on Lake Ontario's southern shore. The Genesee River bisects the city. New York City is about 250 miles (400 km) to the southeast.<div><br></div><div>According to the United States Census Bureau, the city has a total area of 37.1 square miles (96 km^2), of which 35.8 square miles (93 km^2) is land and 1.3 square miles (3.4 km^2) is water (3.42%).<br></div><div><br></div><div>Rochester's geography was formed by the ice sheets during the Pleistocene epoch. The retreating ice sheets reached a standstill at what is now the southern border of the city, melting at the same rate as they were advancing, depositing sediment along the southern edge of the ice mass. This created a line of hills, including (from west to east) Mt. Hope, the hills of Highland Park, Pinnacle Hill, and Cobb's Hill. Because the sediment of these hills was deposited into a proglacial lake, they are stratified and classified as a \"kame delta\". A brief retreat and readvance of the ice sheet onto the delta deposited unstratified material there, creating a rare hybrid structure called \"kame moraine\".<br></div><div><br></div><div>The ice sheets also created Lake Ontario (one of the five freshwater Great Lakes), the Genesee River with its waterfalls and gorges, Irondequoit Bay, Sodus Bay, Braddock Bay, Mendon Ponds, numerous local streams and ponds, the Ridge, and the nearby Finger Lakes.<br></div><div><br></div><div>Rochester has 537 miles (864 km) of public streets, 585 miles (941 km) of water mains, 44 vehicular and eight pedestrian bridges, 11 public libraries, two police stations (one for the east side, one for the west), and 15 firehouses. The principal source of water is Hemlock Lake, which, with its watershed, is owned by the state of New York. Other water sources include Canadice Lake and Lake Ontario. The 30-year annual average snowfall is just above 100 in (2.5 m). The monthly daily average ranges from 24.7 °F (−4.1 °C) in January to 70.8 °F (21.6 °C) in July. The high amount of snow Rochester receives can be accounted for by the city's proximity to Lake Ontario (see lake effect).</div>"}]},{"type":"paragraph","value":[{"type":"text","value":"<b>Climate</b><div><br></div><div>Rochester lies in the humid continental climate zone (Köppen <i>Dfb</i>) and has four distinct seasons, with cold and snowy winters; temperatures drop to 0 °F (−18 °C) on 4.2 nights annually. Autumn features brilliant foliage colors, and summer sees generally comfortable temperatures that usually stay in the range of 80 to 85 °F (27 to 29 °C) accompanied by moderate to high humidity; there are only 6.9 days annually of highs more than 90 °F (32 °C). Precipitation is plentiful year round.<br></div>"}]}]},{"type":"heading","value":"Demographics"},{"type":"section-content","value":[{"type":"paragraph","value":[{"type":"text","value":"According to the 2010 census, the city's population was 43.7% White or White American, 41.7% Black, 0.5% American Indian and Alaska Native, 3.1% Asian, 0.0% Native Hawaiian and Other Pacific Islander, 6.6% from some other race and 4.4% from two or more races. 16.4% of the total population were Hispanic or Latino of any race, mostly made up of Puerto Ricans. Non-Hispanic Whites were 37.6% of the population in 2010, compared to 80.2% in 1970.<div><br></div><div>Over the course of the past 50 years Rochester has become a major center for immigration, particularly for arrivals from Eastern and Southeastern Europe, Subsaharan Africa and the Caribbean. Rochester has the highest percentage of Puerto Ricans of any major city in the United States, one of the four largest Turkish American communities, one of the largest Jamaican American communities in any major U.S city and a large concentration of Polish Americans along with nearby Buffalo, New York. In addition, Rochester is ranked number 9 in the nation for the largest Italian population in the United States.<br></div><div><br></div><div>In 1997, Rochester was reported to have the largest per-capita deaf population in the United States. This is attributed to the fact Rochester is home to the National Technical Institute for the Deaf.<br></div><div><br></div><div>There were 88,999 households of which 30.0% had children under 18 living with them, 25.1% were married couples living together, 23.3% had a female householder with no husband present, and 47.0% were non-families. Of all households, 37.1% were made up of individuals and 9.2% had someone living alone 65 or older. The average household size was 2.36 and the average family size was 3.19.<br></div><div><br></div><div>The city population was 28.1% under 18, 11.6% from 18 to 24, 32.2% from 25 to 44, 18.1% from 45 to 64, and 10.0% who were 65 or older. The median age was 31. For every 100 females, there were 91.6 males. For every 100 females 18 and over, there were 87.3 males.<br></div><div><br></div><div>The median income for a city household was $27,123, and the median family income was $31,257. Males had a median income of $30,521, versus $25,139 for females. The per capita income for the city was $15,588. About 23.4% of families and 25.9% of the population were below the poverty line, including 37.5% of those under age 18 and 15.4% of those age 65 or over.<br></div>"}]},{"type":"paragraph","value":[{"type":"text","value":"<b>Religion</b><div><br></div><div>By the 1920s and 1930s, Rochester's population was roughly half Protestant and half Catholic, although a significant Jewish population also was present. In 1938, there were 214 religious congregations, two thirds of which had been founded after 1880. At that time, the city added, on average, 2.6 new congregations per year, many founded by immigrants from southern and eastern Europe. During peak immigration from 1900–1920 dozens of churches were established, including four Roman Catholic churches with Italian clergy, three Roman Catholic churches with Slavic clergy, Polish Baptist church, 15 Jewish synagogues, and four small Italian Protestant mission churches: Baptist, Evangelical, Methodist, and Presbyterian.<br></div>"}]}]},{"type":"heading","value":"Crime"},{"type":"section-content","value":[{"type":"paragraph","value":[{"type":"text","value":"In 2012, Rochester had 2,061 reported violent crimes, compared to a national average rate of 553.5 violent crimes in cities with populations larger than 100,000. That same year, Rochester had 827 personal crime incidents and 11,054 property crime incidents.<div><br></div><div>In 2012, Rochester reported 36 murders (17.1 per 100,000 people), 95 sexual assaults, 816 robberies, 1,104 aggravated assault, 2,978 burglaries, 7,694 larceny thefts, 111 forcible rape, 622 auto thefts and 152 arson.<br></div>"}]}]},{"type":"heading","value":"Economy"},{"type":"section-content","value":[{"type":"paragraph","value":[{"type":"text","value":"Rochester is home to a number of Fortune 1000 and international businesses, including Eastman Kodak, as well as several national and regional companies, such as Carestream Health. Xerox was founded in Rochester in 1906 as The Haloid Company, and retains a significant presence in Rochester, although its headquarters are now in Norwalk, Connecticut. Bausch &amp; Lomb moved to Bridgewater, New Jersey in 2014. The Gannett newspaper company and Western Union were founded in Rochester by Frank Gannett and Hiram Sibley respectively but have since moved to other cities. The median single-family house price was $135,000 in the second quarter of 2015 in greater Rochester, an increase of 5.4% from a year earlier, according to the National Association of Realtors."}]},{"type":"paragraph","value":[{"type":"text","value":"<b>High technology</b><div><br></div><div>Tech Valley, the technologically recognized area of eastern New York State, has spawned a western offshoot into the Rochester and Finger Lakes areas. Since the 2000s, as established companies in Rochester downsized, Rochester and Monroe County's economy has been redirected toward high technology, with new, smaller companies providing the seed capital necessary for business foundation. The Rochester area is important in the field of photographic processing and imaging as well as incubating an increasingly diverse high technology sphere encompassing STEM fields, in part the result of private startup enterprises collaborating with major academic institutions, including the University of Rochester and Cornell University. Other organizations such as High Tech Rochester provide local startups with mentorship, office space, and other resources. Given the high prevalence of imaging and optical science among the industry and the universities, Rochester is known as the world capital of imaging. The Institute of Optics of the University of Rochester and the Rochester Institute of Technology in nearby Henrietta have imaging programs. In 2006, the University of Rochester became the Rochester area's largest employer, surpassing the Eastman Kodak Company.<br></div>"}]},{"type":"paragraph","value":[{"type":"text","value":"<b>Food and beverage</b><div><br></div><div>One food product Rochester calls its own is the \"white hot\", a variant of the hot dog or smoked bratwurst made by the local Zweigle's company and other companies. Another local specialty is the \"Garbage Plate\", a trademark of Nick Tahou Hots that traditionally includes macaroni salad, home fries, and two hot dogs or cheeseburgers topped with mustard, onions, and their famous meat hot sauce. Many area restaurants feature copies or variations with the word \"plate\" commonly used as a general term. Rochester was home to French's Mustard, whose address was 1 Mustard Street.<br></div><div><br></div><div>The Ragú brand of pasta sauce used to be produced in Rochester. Some of the original facility still exists and produces products for other labels (including Newman's Own) as Private Label Foods.<br></div><div><br></div><div>Other local franchises include: Bill Gray's (a hamburger/hot dog joint that lays claim to having \"The World's Greatest Cheeseburger\"), DiBella's, Tom Wahl's, American Specialty Manufacturing producers of Boss Sauce, Salvatore's Old Fashioned Pizzeria, Mark's Pizzeria, Pontillo's Pizzeria, Perri's Pizzeria, Jeremiah's Tavern, and Abbott's Frozen Custard. Dinosaur Bar-B-Que, which originated in Syracuse, also operates its second franchise downtown in the former Lehigh Valley Railroad station on the Genesee River.<br></div>"}]},{"type":"list","value":[]},{"type":"paragraph","value":[{"type":"text","value":"<b>Breweries</b>"}]},{"type":"list","value":["Genesee Brewing Company","Rohrbach Brewing Company","The Lost Borough Brewing Co.","Three Heads Brewing","Roc Brewing Co.","Iron Tug Brewing","Swiftwater Brewing Company","Fifth Frame Brewing"]},{"type":"paragraph","value":[{"type":"text","value":"<b>Major shopping centers</b>"}]},{"type":"list","value":["Rochester Public Market","Village Gate Square"]}]}],"infobox":{"heading":"Rochester, New York","image":{"file":"/resources/png/infobox-default.png","caption":"(left to right, top to bottom) the Eastman Theater at the Eastman School of Music; First Federal Plaza building; Xerox, Legacy (formerly Bausch &amp; Lomb), and Metropolitan (formerly Chase) towers; Downtown Rochester skyline; Rush Rhees Library at the University of Rochester; Sacred Heart cathedral; row houses in the Grove Place neighborhood"},"items":[{"type":"property","label":"Country","value":"United States"},{"type":"property","label":"State","value":"New York"},{"type":"property","label":"County","value":"Monroe"},{"type":"sub-heading","value":"History"},{"type":"property","label":"Founded","value":"1788"},{"type":"property","label":"Incorporated as a village","value":"March 21, 1817 (as Rochesterville)"},{"type":"property","label":"Incorporated as a city","value":"April 28, 1834"},{"type":"sub-heading","value":"Government"},{"type":"property","label":"Type","value":"Mayor-Council"},{"type":"property","label":"Mayor","value":"Lovely Warren (D)"},{"type":"property","label":"City Council","value":"Carolee A. Conklin (D)<br>Dana K. Miller (D) VP<br>Jacklyn Ortiz (D)<br>Matt Haag (D)<br>Loretta C. Scott (D)<br>Michael A. Patterson (D)<br>Elaine G. Spaull (D)<br>Adam McFadden (D)<br>Carla M. Palumbo (D)"},{"type":"sub-heading","value":"Area"},{"type":"property","label":"City","value":"37.14 sq mi"},{"type":"property","label":"Land","value":"35.78 sq mi"},{"type":"property","label":"Water","value":"1.36 sq mi"},{"type":"property","label":"Elevation","value":"505 ft"},{"type":"sub-heading","value":"Population (2010)"},{"type":"property","label":"City","value":"210,565"},{"type":"property","label":"Estimate (2017)","value":"208,046"},{"type":"property","label":"Density","value":"5,884.99/sq mi"},{"type":"property","label":"Urban","value":"720,572 (US: 60th)"},{"type":"property","label":"Metro","value":"1,082,284 (US: 51st)"},{"type":"sub-heading","value":"Other"},{"type":"property","label":"Demonym(s)","value":"Rochesterian"},{"type":"property","label":"Time zone","value":"UTC-5 (EST)<br>UTC-4 (EDT)"},{"type":"property","label":"ZIP Codes","value":"146XX"},{"type":"property","label":"Area code","value":"585"},{"type":"property","label":"FIPS code","value":"36-63000"},{"type":"property","label":"GNIS feature ID","value":"0962684"},{"type":"property","label":"Website","value":"cityofrochester.gov"}]}}