{"modules":[{"type":"section-content","value":[{"type":"paragraph","value":[{"type":"text","value":"<div>Rochester is a city on the southern shore of Lake Ontario in western New York. With a population of 208,046 residents, Rochester is the seat of Monroe County and the third most populous city in New York state, after New York City and Buffalo. The metropolitan area has a population of just over 1 million people.</div><div><br></div><div>Rochester was America's first boomtown, initially due to the fertile Genesee River Valley, which gave rise to numerous flour mills, and then as a manufacturing hub. Several of the region's universities (notably the University of Rochester and Rochester Institute of Technology) have renowned research programs. Rochester is the site of many important inventions and innovations in consumer products. The Rochester area has been the birthplace to Kodak, Western Union, French's, Bausch &amp; Lomb, Gleason and Xerox, which conduct extensive research and manufacturing of industrial and consumer products. Until 2010, the Rochester metropolitan area was the second-largest regional economy in New York State, after the New York City metropolitan area. Rochester's GMP has since ranked just below Buffalo, New York, while exceeding it in per-capita income.</div><div><br></div><div>The 25th edition of the Places Rated Almanac rated Rochester as the \"most livable city\" in 2007, among 379 U.S. metropolitan areas. In 2010 Forbes rated Rochester as the third-best place to raise a family in the United States. In 2012 Kiplinger rated Rochester as the fifth-best city in the United States for families, citing low cost of living, top public schools, and a low jobless rate.</div>"}]}]},{"type":"heading","value":"History"},{"type":"section-content","value":[{"type":"paragraph","value":[{"type":"text","value":"<div>The Seneca tribe of Native Americans lived in and around Rochester until they lost their claim to most of this land in the Treaty of Big Tree in 1797. Settlement before the Seneca tribe is unknown.</div><div><br></div><div>Development of Rochester followed the American Revolution, and forced cession of their territory by the Iroquois after the defeat of Great Britain. Allied with the British, four major Iroquois tribes were forced out of New York. As a reward for their loyalty to the British Crown, they were given a large land grant on the Grand River in Canada.</div><div><br></div><div>Rochester was founded shortly after the American Revolution by a wave of English-Puritan descended immigrants from New England who were looking for new agricultural land. They would be the dominant cultural group in Rochester for over a century. On November 8, 1803, Col. Nathaniel Rochester (1752–1831), Maj. Charles Carroll, and Col. William Fitzhugh, Jr. (1761–1839), all of Hagerstown, Maryland, purchased a 100-acre (c. 40 ha) tract from the state in Western New York along the Genesee River. They chose the site because its three cataracts on the Genesee offered great potential for water power. Beginning in 1811, and with a population of 15, the three founders surveyed the land and laid out streets and tracts. In 1817, the Brown brothers and other landowners joined their lands with the Hundred Acre Tract to form the village of Rochesterville.</div><div><br></div><div>By 1821, Rochesterville was the seat of Monroe County. In 1823, Rochesterville consisted of 1,012 acres (4 km2) and 2,500 residents, and the Village of Rochesterville became known as Rochester. Also in 1823, the Erie Canal aqueduct over the Genesee River was completed, and the Erie Canal east to the Hudson River was opened. In the early 20th century, after the advent of railroads, the presence of the canal in the center city was an obstacle; it was re-routed south of Rochester. By 1830, Rochester's population was 9,200 and in 1834, it was re-chartered as a city.</div><div><br></div><div>Rochester was first known as \"the Young Lion of the West\", and then as the \"Flour City\". By 1838, Rochester was the largest flour-producing city in the United States. Having doubled its population in only 10 years, Rochester became America's first \"boomtown\".</div><div><br></div><div>In 1830-31, Rochester experienced one of the nation's biggest Protestant revivalist movements, led by Charles Finney. The revival has been noted as inspiring other revivals of the Second Great Awakening. A leading pastor in New York who was converted in the Rochester meetings gave the following account of the effects of Finney's meetings in that city: \"The whole community was stirred. Religion was the topic of conversation in the house, in the shop, in the office and on the street. The only theater in the city was converted into a livery stable; the only circus into a soap and candle factory. Grog shops were closed; the Sabbath was honored; the sanctuaries were thronged with happy worshippers; a new impulse was given to every philanthropic enterprise; the fountains of benevolence were opened, and men lived to good.\"</div><div><br></div><div>By the mid-19th century, as the center of the wheat-processing industry moved west with population and agriculture, the city became home to an expanding nursery business, giving rise to the city's second nickname, the \"Flower City\". Nurseries ringed the city, the most famous of which was started in 1840 by immigrants Georg Ellwanger from Germany and Patrick Barry from Ireland.<br></div><div><br></div><div>In 1847, Frederick Douglass founded the abolitionist newspaper The North Star in Rochester. Douglass, a former slave and an antislavery speaker and writer, gained a circulation of over 4,000 readers in the United States, Europe, and the Caribbean. The North Star served as a forum for abolitionist views. The Douglass home burnt down in 1872, but a marker for it is found in Highland Park off South Avenue.<br></div><div><br></div><div>Susan B. Anthony, a national leader of the women's suffrage movement, was from Rochester. The Nineteenth Amendment to the United States Constitution, which guaranteed the right of women to vote in 1920, was known as the Susan B. Anthony Amendment because of her work toward its passage, which she did not live to see. Anthony's home is a National Historic Landmark known as the National Susan B. Anthony Museum and House.<br></div><div><br></div><div>At the end of the 19th century, anarchist Emma Goldman lived and worked in Rochester for several years, where she championed the cause of labor in Rochester sweatshops. Rochester was also home to significant unrest in labor, race, and antiwar protests.<br></div><div><br></div><div>After the Civil War, Rochester had an expansion of new industries in the late 19th century, founded by migrants to the city, including inventor and entrepreneur George Eastman, who founded Eastman Kodak; and German immigrants John Jacob Bausch and Henry Lomb, who launched Bausch &amp; Lomb in 1861. Not only did they create new industries, but Eastman became a major philanthropist, developing and endowing the University of Rochester, its Eastman School of Music and other local institutions.<br></div><div><br></div><div>In the early 20th century, Rochester became a center of the garment industry, particularly men's fashions. It was the base of enterprises Bond Clothing Stores, Fashion Park Clothes, Hickey Freeman, and Stein-Bloch &amp; Co. The carriage maker James Cunningham and Sons founded a pioneer automobile company – Cunningham.<br></div><div><br></div><div>The population reached 62,386 in 1870, 162,608 in 1900 and 295,750 in 1920. By 1950, the population had reached a high of 332,488. In 1950, the Census Bureau reported Rochester's population as 97.6% white and 2.3% black. With industrial restructuring in the later 20th century, and the decline of industry and jobs in the area, by 2010, the city's population had declined to 210,565, although the metropolitan area was considerably larger.<br></div>"}]}]},{"type":"heading","value":"Geography"},{"type":"section-content","value":[{"type":"paragraph","value":[{"type":"text","value":"Rochester is at 43°9′56″N 77°36′41″W (43.165496, −77.611504). The city is about 65 miles (100 km) east-northeast of Buffalo and about 75 miles (120 km) west of Syracuse; it sits on Lake Ontario's southern shore. The Genesee River bisects the city. New York City is about 250 miles (400 km) to the southeast."}]}]}],"infobox":{"heading":"Rochester, New York","image":{"file":"","caption":""},"items":[]}}