{"modules":[{"type":"section-content","value":[{"type":"paragraph","value":[{"type":"text","value":"Pegasus (Greek: Πήγασος, Pḗgasos; Latin: Pegasus, Pegasos) is a mythical winged divine stallion, and one of the most recognized creatures in Greek mythology. Usually depicted as pure white, Pegasus is a child of the Olympian god Poseidon. He was foaled by the Gorgon Medusa upon her death, when the hero Perseus decapitated her. Pegasus is the brother of Chrysaor and the uncle of Geryon.<div><br></div><div>Greco-Roman poets wrote about the ascent of Pegasus to heaven after his birth, and his subsequent obeisance to Zeus, king of the gods, who instructed him to bring lightning and thunder from Olympus. Friend of the Muses, Pegasus created Hippocrene, the fountain on Mt. Helicon.<br></div><div><br></div><div>Pegasus was caught by the Greek hero Bellerophon, near the fountain Peirene, with the help of Athena and Poseidon. Pegasus allowed Bellerophon to ride him in order to defeat the monstrous Chimera, which led to many other exploits. Bellerophon later fell from the winged horse's back while trying to reach Mount Olympus. Afterwards, Zeus transformed Pegasus into the eponymous constellation.<br></div><div><br></div><div>The symbolism of Pegasus varies with time. Symbolic of wisdom and fame from the Middle Ages until the Renaissance, Pegasus became associated with poetry around the 19th century, as the fountainhead of sources from which the poets gained their inspiration. Pegasus is the subject of a very rich iconography, especially throughout ancient Greek pottery and paintings and sculptures of the Renaissance. Hypotheses have been proposed regarding the relationship between Pegasus and the Muses, the gods Athena, Poseidon, Zeus, Apollo, and the hero Perseus.<br></div>"}]}]},{"type":"heading","value":"Etymology"},{"type":"section-content","value":[{"type":"paragraph","value":[{"type":"text","value":"The poet Hesiod presents a folk etymology of the name Pegasus as derived from πηγή pēgē \"spring, well\": \"the pegai of Okeanos, where he was born.\"<div><br></div><div>A proposed etymology of the name is Luwian pihassas, meaning \"lightning\", and Pihassassi, a local Luwian-Hittite name in southern Cilicia of a weather god represented with thunder and lightning. The proponents of this etymology adduce Pegasus' role, reported as early as Hesiod, as the bringer of thunderbolts to Zeus. It was first suggested in 1952 and remains widely accepted, but Robin Lane Fox (2009) has criticized it as implausible.<br></div>"}]}]},{"type":"heading","value":"Pegasus and springs"},{"type":"section-content","value":[{"type":"paragraph","value":[{"type":"text","value":"According to legend, everywhere the winged horse struck his hoof to the earth, an inspiring water spring burst forth. One of these springs was upon the Muses' Mount Helicon, the Hippocrene (\"horse spring\"), opened, Antoninus Liberalis suggested, at the behest of Poseidon to prevent the mountain swelling with rapture at the song of the Muses; another was at Troezen. Hesiod relates how Pegasus was peacefully drinking from a spring when the hero Bellerophon captured him. Hesiod also says Pegasus carried thunderbolts for Zeus."}]}]},{"type":"heading","value":"Birth"},{"type":"section-content","value":[{"type":"paragraph","value":[{"type":"text","value":"There are several versions of the birth of the winged stallion and his brother Chrysaor in the far distant place at the edge of Earth, Hesiod's \"springs of Oceanus, which encircles the inhabited earth, where Perseus found Medusa:<div><br></div><div>One is that they sprang from the blood issuing from Medusa's neck as Perseus was beheading her, similar to the manner in which Athena was born from the head of Zeus. In another version, when Perseus beheaded Medusa, they were born of the Earth, fed by the Gorgon's blood. A variation of this story holds that they were formed from the mingling of Medusa's blood, pain and sea foam, implying that Poseidon had involvement in their making. The last version bears resemblance to Hesiod's account of the birth of Aphrodite from the foam created when Uranus's severed genitals were cast into the sea by Cronus.<br></div>"}]}]}],"infobox":{"heading":"Pegasus (mythology)","image":{"file":"/resources/png/infobox-default.png","caption":"Bellerophon riding Pegasus (1914)"},"items":[{"type":"property","label":"Grouping","value":"Mythology"},{"type":"property","label":"Sub grouping","value":"Mythical horse"},{"type":"property","label":"Similar creatures","value":"Unicorn, Qilin, Buraq"},{"type":"property","label":"Mythology","value":"Worldwide"}]}}